#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/adil/Automte-AWS-using-terraform-and-github-actions/runs/run-tifdqqrf6EgaKF6u

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_instance.server-1: Refreshing state... [id=i-0f9dca8ec33cecc6d]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.server-1 has changed
  ~ resource "aws_instance" "server-1" {
      + arn                                  = "arn:aws:ec2:us-east-1:606930474799:instance/i-0f9dca8ec33cecc6d"
      + associate_public_ip_address          = true
      + disable_api_termination              = false
      + ebs_optimized                        = false
        id                                   = "i-0f9dca8ec33cecc6d"
      + instance_initiated_shutdown_behavior = "stop"
      + ipv6_address_count                   = 0
      + ipv6_addresses                       = []
      + monitoring                           = false
      + primary_network_interface_id         = "eni-01eced6d5bad6ac6a"
      ~ security_groups                      = [
          + "default",
        ]
      + subnet_id                            = "subnet-0cb0efbf560c3ccd8"
        tags                                 = {
            "Name" = "server-1"
        }
      ~ vpc_security_group_ids               = [
          + "sg-0626254ca819ffc9e",
        ]
        # (16 unchanged attributes hidden)

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + credit_specification {
          + cpu_credits = "standard"
        }



      + root_block_device {
          + delete_on_termination = true
          + device_name           = "/dev/xvda"
          + encrypted             = false
          + iops                  = 100
          + tags                  = {}
          + throughput            = 0
          + volume_id             = "vol-06f046726c5c931ca"
          + volume_size           = 8
          + volume_type           = "gp2"
        }
        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.server-1 will be destroyed
  # (because aws_instance.server-1 is not in configuration)
  - resource "aws_instance" "server-1" {
      - ami                                  = "ami-01b20f5ea962e3fe7" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:606930474799:instance/i-0f9dca8ec33cecc6d" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0f9dca8ec33cecc6d" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-01eced6d5bad6ac6a" -> null
      - private_dns                          = "ip-172-31-81-89.ec2.internal" -> null
      - private_ip                           = "172.31.81.89" -> null
      - public_dns                           = "ec2-35-170-249-19.compute-1.amazonaws.com" -> null
      - public_ip                            = "35.170.249.19" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "default",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0cb0efbf560c3ccd8" -> null
      - tags                                 = {
          - "Name" = "server-1"
        } -> null
      - tags_all                             = {
          - "Name" = "server-1"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-0626254ca819ffc9e",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06f046726c5c931ca" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.terraformserver will be created
  + resource "aws_instance" "terraformserver" {
      + ami                                  = "ami-01b20f5ea962e3fe7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-server"
        }
      + tags_all                             = {
          + "Name" = "terraform-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
</details>
*Pusher: @adilshehzad786, Action: `pull_request`*